package com.xixiwan.platform.exception.enums;

public enum WebEnum {

    ERROR_0001("0001", "未登录"),
    ERROR_0002("0002", "请求数据不能为空"),
    ERROR_0003("0003", "用户名不能为空"),
    ERROR_0004("0004", "用户不存在"),
    ERROR_0005("0005", "密码不能为空"),
    ERROR_0006("0006", "邮箱不能为空"),
    ERROR_0007("0007", "用户名已存在"),
    ERROR_0008("0008", "邮箱已存在"),
    ERROR_0009("0009", "编码不能为空"),
    ERROR_0010("0010", "编码已存在"),
    ERROR_0011("0011", "ID不能为空"),
    ERROR_0012("0012", "数据库不存在"),
    ERROR_0013("0013", "菜单存在子菜单不允许删除"),
    ERROR_0014("0014", "权限不能为空"),
    ERROR_0015("0015", "权限已存在"),
    ERROR_0016("0016", "角色已赋予用户不允许删除"),
    ERROR_0017("0017", "角色ID不能为空"),
    ERROR_0018("0018", "菜单ID不能为空"),
    ERROR_0019("0019", "头像文件不能为空"),
    ERROR_0020("0020", "文件名不能为空"),
    ERROR_0021("0021", "用户ID不能为空"),
    ERROR_0022("0022", "重置类型不能为空"),
    ERROR_0023("0023", "重置值不能为空"),
    ERROR_0024("0024", "邮箱格式错误"),
    ERROR_0025("0025", "邮箱不存在"),
    ERROR_0026("0026", "手机号码格式错误"),
    ERROR_0027("0027", "手机号码不存在"),
    ERROR_0028("0028", "发送验证码失败"),
    ERROR_0029("0029", "验证码不能为空"),
    ERROR_0030("0030", "没有发送验证码"),
    ERROR_0031("0031", "验证码已使用"),
    ERROR_0032("0032", "验证码已过期"),
    ERROR_0033("0033", "验证码不正确"),
    ERROR_0034("0034", "密码错误"),
    ERROR_0035("0035", "密码未过期"),
    ERROR_0036("0036", "原密码不能为空"),
    ERROR_0037("0037", "原密码与新密码不能相同"),
    ERROR_0038("0038", "父级不能为空"),
    ERROR_0039("0039", "只能修改状态为未发布的通知"),
    ERROR_0040("0040", "只能发布状态为未发布的通知"),
    ERROR_0041("0041", "数据库不存在用户");

    private String code;

    private String message;

    WebEnum(String code, String message) {
        this.code = code;
        this.message = message;
    }

    public String getCode() {
        return code;
    }

    public String getMessage() {
        return message;
    }

}
